http/results/retro-lwt-effects-libev-R20000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.900ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.013ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.195ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.207ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.42ms   21.33ms 150.02ms   90.78%
    Req/Sec     5.11k     1.22k   10.24k    72.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.64ms
 75.000%    9.45ms
 90.000%   29.44ms
 99.000%  119.55ms
 99.900%  139.13ms
 99.990%  144.90ms
 99.999%  148.61ms
100.000%  150.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.094     0.000000            1         1.00
       1.273     0.100000        19771         1.11
       1.835     0.200000        39502         1.25
       2.301     0.300000        59271         1.43
       2.845     0.400000        79003         1.67
       3.641     0.500000        98775         2.00
       4.231     0.550000       108625         2.22
       5.211     0.600000       118479         2.50
       6.567     0.650000       128378         2.86
       7.983     0.700000       138233         3.33
       9.455     0.750000       148114         4.00
      10.327     0.775000       153049         4.44
      11.711     0.800000       157977         5.00
      13.575     0.825000       162905         5.71
      16.991     0.850000       167851         6.67
      22.063     0.875000       172779         8.00
      25.279     0.887500       175244         8.89
      29.439     0.900000       177713        10.00
      34.719     0.912500       180193        11.43
      38.303     0.925000       182671        13.33
      44.159     0.937500       185118        16.00
      48.287     0.943750       186351        17.78
      52.415     0.950000       187593        20.00
      56.895     0.956250       188831        22.86
      66.623     0.962500       190054        26.67
      81.791     0.968750       191294        32.00
      86.463     0.971875       191909        35.56
      90.431     0.975000       192524        40.00
      94.527     0.978125       193139        45.71
      98.239     0.981250       193754        53.33
     103.679     0.984375       194377        64.00
     108.095     0.985938       194684        71.11
     113.151     0.987500       194989        80.00
     116.287     0.989062       195303        91.43
     120.831     0.990625       195605       106.67
     125.439     0.992188       195915       128.00
     127.871     0.992969       196080       142.22
     129.919     0.993750       196233       160.00
     131.711     0.994531       196384       182.86
     132.479     0.995313       196548       213.33
     133.631     0.996094       196701       256.00
     134.015     0.996484       196769       284.44
     134.399     0.996875       196844       320.00
     135.423     0.997266       196917       365.71
     136.063     0.997656       196998       426.67
     136.831     0.998047       197075       512.00
     137.343     0.998242       197112       568.89
     137.727     0.998437       197155       640.00
     137.983     0.998633       197193       731.43
     138.751     0.998828       197227       853.33
     139.263     0.999023       197276      1024.00
     139.391     0.999121       197297      1137.78
     139.519     0.999219       197319      1280.00
     139.647     0.999316       197326      1462.86
     139.903     0.999414       197342      1706.67
     140.543     0.999512       197366      2048.00
     141.055     0.999561       197373      2275.56
     141.311     0.999609       197383      2560.00
     141.439     0.999658       197391      2925.71
     141.823     0.999707       197399      3413.33
     142.975     0.999756       197409      4096.00
     143.231     0.999780       197414      4551.11
     143.359     0.999805       197418      5120.00
     143.615     0.999829       197425      5851.43
     143.999     0.999854       197428      6826.67
     144.639     0.999878       197434      8192.00
     144.895     0.999890       197439      9102.22
     144.895     0.999902       197439     10240.00
     145.023     0.999915       197443     11702.86
     145.023     0.999927       197443     13653.33
     145.151     0.999939       197446     16384.00
     145.151     0.999945       197446     18204.44
     145.279     0.999951       197447     20480.00
     145.407     0.999957       197448     23405.71
     145.919     0.999963       197449     27306.67
     146.047     0.999969       197450     32768.00
     146.687     0.999973       197451     36408.89
     147.455     0.999976       197452     40960.00
     147.455     0.999979       197452     46811.43
     147.967     0.999982       197453     54613.33
     147.967     0.999985       197453     65536.00
     148.607     0.999986       197454     72817.78
     148.607     0.999988       197454     81920.00
     148.607     0.999989       197454     93622.86
     149.631     0.999991       197455    109226.67
     149.631     0.999992       197455    131072.00
     149.631     0.999993       197455    145635.56
     149.631     0.999994       197455    163840.00
     149.631     0.999995       197455    187245.71
     150.143     0.999995       197456    218453.33
     150.143     1.000000       197456          inf
#[Mean    =       11.417, StdDeviation   =       21.335]
#[Max     =      150.016, Total count    =       197456]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398777 requests in 20.00s, 805.48MB read
Requests/sec:  19937.23
Transfer/sec:     40.27MB

JSON Output:
{
	"requests": 398777,
	"duration_in_microseconds": 20001625.00,
	"bytes": 844609686,
	"requests_per_sec": 19937.23,
	"bytes_transfer_per_sec": 42227053.35,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 3641
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 9455
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 29439
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 119551
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 139135
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 144895
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 148607
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 150143
		}
	]
}