http/results/retro-lwt-effects-uring-R20000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 8.373ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 8.369ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 8.345ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 8.456ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.08ms   16.59ms  88.90ms   89.08%
    Req/Sec     5.05k     1.05k    9.83k    73.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.77ms
 75.000%   13.72ms
 90.000%   34.78ms
 99.000%   83.58ms
 99.900%   87.42ms
 99.990%   88.51ms
 99.999%   88.96ms
100.000%   88.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.089     0.000000            1         1.00
       2.995     0.100000        19627         1.11
       3.991     0.200000        39239         1.25
       5.267     0.300000        58854         1.43
       7.039     0.400000        78441         1.67
       8.767     0.500000        98106         2.00
       9.527     0.550000       107857         2.22
      10.279     0.600000       117698         2.50
      11.159     0.650000       127472         2.86
      12.159     0.700000       137352         3.33
      13.719     0.750000       147080         4.00
      14.895     0.775000       152005         4.44
      16.671     0.800000       156929         5.00
      19.791     0.825000       161793         5.71
      23.647     0.850000       166689         6.67
      27.423     0.875000       171606         8.00
      29.311     0.887500       174039         8.89
      34.783     0.900000       176492        10.00
      40.895     0.912500       178950        11.43
      47.007     0.925000       181393        13.33
      50.687     0.937500       183867        16.00
      52.767     0.943750       185079        17.78
      54.623     0.950000       186317        20.00
      56.959     0.956250       187539        22.86
      59.359     0.962500       188758        26.67
      63.391     0.968750       189974        32.00
      66.687     0.971875       190590        35.56
      70.975     0.975000       191217        40.00
      72.575     0.978125       191850        45.71
      73.535     0.981250       192454        53.33
      74.495     0.984375       193040        64.00
      76.351     0.985938       193344        71.11
      79.551     0.987500       193657        80.00
      81.087     0.989062       193957        91.43
      84.671     0.990625       194270       106.67
      85.503     0.992188       194590       128.00
      85.823     0.992969       194743       142.22
      86.079     0.993750       194896       160.00
      86.335     0.994531       195075       182.86
      86.527     0.995313       195239       213.33
      86.655     0.996094       195362       256.00
      86.783     0.996484       195485       284.44
      86.847     0.996875       195534       320.00
      86.911     0.997266       195597       365.71
      86.975     0.997656       195660       426.67
      87.103     0.998047       195759       512.00
      87.103     0.998242       195759       568.89
      87.167     0.998437       195799       640.00
      87.231     0.998633       195843       731.43
      87.359     0.998828       195898       853.33
      87.423     0.999023       195926      1024.00
      87.487     0.999121       195946      1137.78
      87.551     0.999219       195966      1280.00
      87.551     0.999316       195966      1462.86
      87.743     0.999414       195993      1706.67
      87.871     0.999512       196006      2048.00
      87.935     0.999561       196015      2275.56
      88.063     0.999609       196029      2560.00
      88.191     0.999658       196040      2925.71
      88.255     0.999707       196051      3413.33
      88.319     0.999756       196061      4096.00
      88.319     0.999780       196061      4551.11
      88.383     0.999805       196069      5120.00
      88.383     0.999829       196069      5851.43
      88.447     0.999854       196076      6826.67
      88.511     0.999878       196082      8192.00
      88.511     0.999890       196082      9102.22
      88.511     0.999902       196082     10240.00
      88.575     0.999915       196086     11702.86
      88.575     0.999927       196086     13653.33
      88.639     0.999939       196092     16384.00
      88.639     0.999945       196092     18204.44
      88.639     0.999951       196092     20480.00
      88.639     0.999957       196092     23405.71
      88.767     0.999963       196093     27306.67
      88.831     0.999969       196096     32768.00
      88.831     0.999973       196096     36408.89
      88.831     0.999976       196096     40960.00
      88.831     0.999979       196096     46811.43
      88.895     0.999982       196097     54613.33
      88.959     0.999985       196100     65536.00
      88.959     1.000000       196100          inf
#[Mean    =       14.077, StdDeviation   =       16.587]
#[Max     =       88.896, Total count    =       196100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  397407 requests in 20.00s, 802.72MB read
Requests/sec:  19868.63
Transfer/sec:     40.13MB

JSON Output:
{
	"requests": 397407,
	"duration_in_microseconds": 20001732.00,
	"bytes": 841708026,
	"requests_per_sec": 19868.63,
	"bytes_transfer_per_sec": 42081757.02,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 8767
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 13719
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 34783
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 83583
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 87423
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 88511
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 88959
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 88959
		}
	]
}